---
## Front matter
lang: ru-RU
title: Lab3

## Formatting
toc: false
slide_level: 2
theme: metropolis
header-includes: 
aspectratio: 43
section-titles: true
---

# Теоретическое введение

Apache HTTP-сервер (является искажённым сокращением от англ. a patchy server; среди русских пользователей общепринято переводное апа́ч) — свободный веб-сервер.

Apache является кроссплатформенным ПО, поддерживает операционные системы Linux, BSD, macOS, Microsoft Windows, Novell NetWare, BeOS.

Основными достоинствами Apache считаются надёжность и гибкость конфигурации. Он позволяет подключать внешние модули для предоставления данных, использовать СУБД для аутентификации пользователей, модифицировать сообщения об ошибках и т. д. Поддерживает IPv4. 

SELinux (англ. Security-Enhanced Linux — Linux с улучшенной безопасностью) — реализация системы принудительного контроля доступа, которая может работать параллельно с классической избирательной системой контроля доступа. 

Оставаясь в рамках избирательной системы контроля доступа, операционная система имеет фундаментальное ограничение в плане разделения доступа процессов к ресурсам — доступ к ресурсам основывается на правах доступа пользователя. Это классические права rwx на трех уровнях — владелец, группа-владелец и остальные. 

# Выполнение лабораторной работы


![SELinux работает в режиме enforcing политики targeted](image/1.png){ #fig:001 width=70% }

![service httpd status](image/2.png){ #fig:002 width=70% }

![остояние переключателей SELinux](image/3.png){ #fig:003 width=70% }


![Тип файлов в директории /var/www](image/4.png){ #fig:004 width=70% }


![Отображение файла test.html](image/5.png){ #fig:005 width=70% }


![Контекст test.html](image/6.png){ #fig:006 width=70% }


![Ошибка доступа](image/7.png){ #fig:007 width=70% }


![Просмотр логов](image/7.png){ #fig:007 width=70% }


## {.standout}


